      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      * A comment line can be written in any column. The compiler does not check a comment line for syntax and treats it for documentation
      **************************************************************fdfffffffffffffffffffffff****
       IDENTIFICATION DIVISION.
      * Cobol is case insensitive since COBOL-85
      * Note that COBOL code, other than literals, is case-insensitive
       PROGRAM-iD. ELH-MY-ILKI-COBOL-PRG3.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Umit/Metanet/hardwork/Towekgel/Skr, gerisi void"
            STOP RUN.
       END PROGRAM ELH-MY-ILKI-COBOL-PRG3.
